app/controllers/restaurants_controller.rb

  def index
    @restaurant = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Hawksmoor"], ["created_at", "2016-03-01 10:08:30.675738"], ["updated_at", "2016-03-01 10:08:30.675738"]]